---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StructuralCustomConnectionFailures.StructuralCustomConnectionEmpty
source: html/0ad0fcff-bb9c-032b-a9b6-4a5f52589fa6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StructuralCustomConnectionFailures.StructuralCustomConnectionEmpty Property

Structural Custom Connection cannot be empty.

## Syntax (C#)
```csharp
public static FailureDefinitionId StructuralCustomConnectionEmpty { get; }
```